# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArray..::..Append Method
EdgeArray Class See Also
---
Add the edge to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Edge item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Edge _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Edge^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..EdgeThe edge to be added.
# See Also
EdgeArray Class
Autodesk.Revit.DB Namespace